# NumberOfFrames Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SunAndShadowSettings..::..NumberOfFrames Property
SunAndShadowSettings Class See Also
---
Identifies the total number of animation frames for a single-day or multi-day study.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double NumberOfFrames { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberOfFrames As Double
	Get
```

Visual C++
---
```text
public:
property double NumberOfFrames {
	double get ();
}
```

# See Also
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace